; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=11, locations=12, max_capacity=2, out_folder=training/easy, instance_id=65, seed=106

(define (problem transport-65)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at p2 l4)
    (at p3 l8)
    (at p4 l6)
    (at p5 l7)
    (at p6 l8)
    (at p7 l12)
    (at p8 l11)
    (at p9 l5)
    (at p10 l12)
    (at p11 l4)
    (at v1 l12)
    (at v2 l8)
    (at v3 l5)
    (at v4 l12)
    (at v5 l8)
    (road l12 l7)
    (road l4 l9)
    (road l9 l2)
    (road l5 l10)
    (road l10 l6)
    (road l10 l9)
    (road l1 l9)
    (road l9 l1)
    (road l9 l7)
    (road l9 l4)
    (road l9 l10)
    (road l10 l5)
    (road l10 l11)
    (road l11 l10)
    (road l7 l9)
    (road l7 l12)
    (road l6 l10)
    (road l3 l2)
    (road l8 l7)
    (road l2 l3)
    (road l2 l9)
    (road l7 l8)
    (road l1 l5)
    (road l5 l1)
    (road l1 l3)
    (road l3 l1)
    (road l6 l8)
    (road l8 l6)
    (road l4 l8)
    (road l8 l4)
    (road l6 l11)
    (road l11 l6)
    (road l3 l9)
    (road l9 l3)
    (road l1 l6)
    (road l6 l1)
    (road l1 l7)
    (road l7 l1)
    (road l1 l2)
    (road l2 l1)
    (road l3 l8)
    (road l8 l3)
    (road l1 l4)
    (road l4 l1)
    (road l9 l12)
    (road l12 l9)
    (road l8 l10)
    (road l10 l8)
    (road l2 l4)
    (road l4 l2)
    (road l6 l7)
    (road l7 l6)
    (road l3 l7)
    (road l7 l3)
    (road l3 l11)
    (road l11 l3)
    (road l8 l12)
    (road l12 l8)
    (road l1 l10)
    (road l10 l1)
    (road l5 l9)
    (road l9 l5)
    (road l1 l8)
    (road l8 l1)
    (road l5 l12)
    (road l12 l5)
    (road l8 l9)
    (road l9 l8)
    (road l2 l8)
    (road l8 l2)
    (road l4 l11)
    (road l11 l4)
    (road l2 l5)
    (road l5 l2)
    (road l4 l12)
    (road l12 l4)
    (road l3 l10)
    (road l10 l3)
    )
 (:goal  (and 
    (at p1 l8)
    (at p2 l9)
    (at p3 l12)
    (at p4 l4)
    (at p5 l9)
    (at p6 l1)
    (at p7 l4)
    (at p8 l2)
    (at p9 l12)
    (at p10 l7)
    (at p11 l2))))

; plan
1. (drive v1 l12 l9)
   deleted: (at v1 l12)
   added: (at v1 l9)
   goals met: 0 of 11
2. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 0 of 11
3. (pick-up v1 l2 p1 c1 c2)
   deleted: (at p1 l2) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 11
4. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 0 of 11
5. (drop v1 l8 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l8) (capacity v1 c2)
   goals met: 1 of 11
6. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 1 of 11
7. (pick-up v1 l4 p2 c1 c2)
   deleted: (at p2 l4) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 11
8. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 1 of 11
9. (drop v1 l9 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l9) (capacity v1 c2)
   goals met: 2 of 11
10. (drive v1 l9 l8)
   deleted: (at v1 l9)
   added: (at v1 l8)
   goals met: 2 of 11
11. (pick-up v1 l8 p3 c1 c2)
   deleted: (at p3 l8) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 11
12. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 2 of 11
13. (drop v1 l12 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l12) (capacity v1 c2)
   goals met: 3 of 11
14. (drive v1 l12 l7)
   deleted: (at v1 l12)
   added: (at v1 l7)
   goals met: 3 of 11
15. (drive v1 l7 l6)
   deleted: (at v1 l7)
   added: (at v1 l6)
   goals met: 3 of 11
16. (pick-up v1 l6 p4 c1 c2)
   deleted: (at p4 l6) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 11
17. (drive v1 l6 l8)
   deleted: (at v1 l6)
   added: (at v1 l8)
   goals met: 3 of 11
18. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 3 of 11
19. (drop v1 l4 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l4) (capacity v1 c2)
   goals met: 4 of 11
20. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 4 of 11
21. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 4 of 11
22. (pick-up v1 l7 p5 c1 c2)
   deleted: (at p5 l7) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 11
23. (drive v1 l7 l9)
   deleted: (at v1 l7)
   added: (at v1 l9)
   goals met: 4 of 11
24. (drop v1 l9 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l9) (capacity v1 c2)
   goals met: 5 of 11
25. (drive v1 l9 l8)
   deleted: (at v1 l9)
   added: (at v1 l8)
   goals met: 5 of 11
26. (pick-up v1 l8 p6 c1 c2)
   deleted: (at p6 l8) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 11
27. (drive v1 l8 l1)
   deleted: (at v1 l8)
   added: (at v1 l1)
   goals met: 5 of 11
28. (drop v1 l1 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l1) (capacity v1 c2)
   goals met: 6 of 11
29. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 6 of 11
30. (drive v1 l9 l12)
   deleted: (at v1 l9)
   added: (at v1 l12)
   goals met: 6 of 11
31. (pick-up v1 l12 p7 c1 c2)
   deleted: (at p7 l12) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 6 of 11
32. (drive v1 l12 l4)
   deleted: (at v1 l12)
   added: (at v1 l4)
   goals met: 6 of 11
33. (drop v1 l4 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l4) (capacity v1 c2)
   goals met: 7 of 11
34. (drive v1 l4 l11)
   deleted: (at v1 l4)
   added: (at v1 l11)
   goals met: 7 of 11
35. (pick-up v1 l11 p8 c1 c2)
   deleted: (at p8 l11) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 7 of 11
36. (drive v1 l11 l3)
   deleted: (at v1 l11)
   added: (at v1 l3)
   goals met: 7 of 11
37. (drive v1 l3 l2)
   deleted: (at v1 l3)
   added: (at v1 l2)
   goals met: 7 of 11
38. (drop v1 l2 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l2) (capacity v1 c2)
   goals met: 8 of 11
39. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 8 of 11
40. (pick-up v1 l5 p9 c1 c2)
   deleted: (at p9 l5) (capacity v1 c2)
   added: (in p9 v1) (capacity v1 c1)
   goals met: 8 of 11
41. (drive v1 l5 l12)
   deleted: (at v1 l5)
   added: (at v1 l12)
   goals met: 8 of 11
42. (drop v1 l12 p9 c1 c2)
   deleted: (in p9 v1) (capacity v1 c1)
   added: (at p9 l12) (capacity v1 c2)
   goals met: 9 of 11
43. (pick-up v1 l12 p10 c1 c2)
   deleted: (at p10 l12) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 9 of 11
44. (drive v1 l12 l7)
   deleted: (at v1 l12)
   added: (at v1 l7)
   goals met: 9 of 11
45. (drop v1 l7 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l7) (capacity v1 c2)
   goals met: 10 of 11
46. (drive v1 l7 l9)
   deleted: (at v1 l7)
   added: (at v1 l9)
   goals met: 10 of 11
47. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 10 of 11
48. (pick-up v1 l4 p11 c1 c2)
   deleted: (at p11 l4) (capacity v1 c2)
   added: (in p11 v1) (capacity v1 c1)
   goals met: 10 of 11
49. (drive v1 l4 l2)
   deleted: (at v1 l4)
   added: (at v1 l2)
   goals met: 10 of 11
50. (drop v1 l2 p11 c1 c2)
   deleted: (in p11 v1) (capacity v1 c1)
   added: (at p11 l2) (capacity v1 c2)
   goals met: 11 of 11
